# Шаг 1. Расстановка кораблей пользователя и компьютера
# создаём два массива расстановки кораблей

# Шаг 2. Вывести оба поля на экран.

import random

pole1 = [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]

pole2 = [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]

def printpole(pole1, pole2):
    print('      А Б В Г Д Е Ж З И К             А Б В Г Д Е Ж З И К')
    print('    |--------------------           |--------------------')
    for i in range(0, len(pole1)):
        if i < 9:
            n = ' '
        else: n = ''
        print(i+1, n, '| ', end='')
        for i2 in range(0, len(pole1[i])):
            print(pole1[i][i2], end=' ')
        print('     ', end=' ')
        print(i+1, n, '| ', end='')
        for n2 in range(0, len(pole2[i])):
            print(pole2[i][n2], end=' ')
        print()

#ставим 4 палубник
while True:
    h = bool(random.getrandbits(1))
    x = random.randint(0, 9)
    y = random.randint(0, 9)
    print(x,y,h)
    if h:
        if x > 6:
            break
        pole2[x][y] = 2
        pole2[x+1][y] = 2
        pole2[x+2][y] = 2
        pole2[x + 3][y] = 2
    else:
        if y > 6:
            break
        pole2[x][y] = 2
        pole2[x][y+1] = 2
        pole2[x][y+2] = 2
        pole2[x][y+3] = 2

printpole(pole1, pole2)